Data analysis using Python (SQL Magic) on HR sample schema - Oracle database 11g by the new python-oracledb API.
<br>This analysis calculates total salaries for each job title and for each department.

To Install Required Libraries:

In [1]:
# !python -m pip install oracledb --upgrade
# !pip install sqlalchemy

In [2]:
import oracledb
import sqlalchemy

To enable thick mode:

In [3]:
oracledb.init_oracle_client()

To load SQL Magic:

In [4]:
%load_ext sql

In [5]:
%sql oracle+oracledb://hr:hr@192.168.117.137:1521/?service_name=orcl

In [6]:
%%sql
select * 
from (select e.first_name, e.last_name, e.salary, j.job_title, d.department_name
from employees e left outer join departments d
on (e.department_id = d.department_id)
join jobs j
on (e.job_id = j.job_id)
order by e.salary desc, j.job_title, d.department_name)
where rownum <= 10

 * oracle+oracledb://hr:***@192.168.117.137:1521/?service_name=orcl
0 rows affected.

[('Steven', 'King', Decimal('24000'), 'President', 'Executive'),
 ('Neena', 'Kochhar', Decimal('17000'), 'Administration Vice President', 'Executive'),
 ('Lex', 'De Haan', Decimal('17000'), 'Administration Vice President', 'Executive'),
 ('John', 'Russell', Decimal('14000'), 'Sales Manager', 'Sales'),
 ('Karen', 'Partners', Decimal('13500'), 'Sales Manager', 'Sales'),
 ('Michael', 'Hartstein', Decimal('13000'), 'Marketing Manager', 'Marketing'),
 ('Shelley', 'Higgins', Decimal('12000'), 'Accounting Manager', 'Accounting'),
 ('Nancy', 'Greenberg', Decimal('12000'), 'Finance Manager', 'Finance'),
 ('Alberto', 'Errazuriz', Decimal('12000'), 'Sales Manager', 'Sales'),
 ('Lisa', 'Ozer', Decimal('11500'), 'Sales Representative', 'Sales')]

In [7]:
%%sql
select j.job_title, sum(e.salary) as sum_salary
from employees e join jobs j
on (e.job_id = j.job_id)
group by j.job_title
order by sum(e.salary) desc

 * oracle+oracledb://hr:***@192.168.117.137:1521/?service_name=orcl
0 rows affected.

[('Sales Representative', 250500),
 ('Shipping Clerk', 64300),
 ('Sales Manager', 61000),
 ('Stock Clerk', 55700),
 ('Accountant', 39600),
 ('Stock Manager', 36400),
 ('Administration Vice President', 34000),
 ('Programmer', 28800),
 ('President', 24000),
 ('Purchasing Clerk', 13900),
 ('Marketing Manager', 13000),
 ('Finance Manager', 12000),
 ('Accounting Manager', 12000),
 ('Purchasing Manager', 11000),
 ('Public Relations Representative', 10000),
 ('Public Accountant', 8300),
 ('Human Resources Representative', 6500),
 ('Marketing Representative', 6000),
 ('Administration Assistant', 4400)]

In [8]:
%%sql
select d.department_name, sum(e.salary) as sum_salary
from employees e left outer join departments d
on (e.department_id = d.department_id)
group by d.department_name
order by sum(e.salary) desc

 * oracle+oracledb://hr:***@192.168.117.137:1521/?service_name=orcl
0 rows affected.

[('Sales', 304500),
 ('Shipping', 156400),
 ('Executive', 58000),
 ('Finance', 51600),
 ('IT', 28800),
 ('Purchasing', 24900),
 ('Accounting', 20300),
 ('Marketing', 19000),
 ('Public Relations', 10000),
 (None, 7000),
 ('Human Resources', 6500),
 ('Administration', 4400)]